Tekla Open API Reference for Tekla Structures 2025
ProfileItem.IsCLBProfile Property
 Whether the profile is a clb profile.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsCLBProfile { get; }
Public ReadOnly Property IsCLBProfile As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace